# GetFabricationConfiguration Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetFabricationConfiguration Method
FabricationConfiguration Class See Also
---
Gets the fabrication configuration element in the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static FabricationConfiguration GetFabricationConfiguration(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetFabricationConfiguration ( _
	document As Document _
) As FabricationConfiguration
```

Visual C++
---
```text
public:
static FabricationConfiguration^ GetFabricationConfiguration(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The fabrication configuration element in the document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace